In [1]:
%load_ext sql

In [2]:
!env | grep POST

POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [3]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [4]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [5]:
%%sql $CONNECT_DATA
    SELECT * FROM pg_database

4 rows affected.

[(13760, 'postgres', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, True, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13759, 'template0', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, False, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (16384, 'demo', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, '{=Tc/postgres,postgres=CTc/postgres,reader=c/postgres}')]

result =%sql SELECT passenger_name, passenger_id, contact_data FROM tickets WHERE ticket_no = '0005432312164'
print(result)

### Q1: Which fare conditions are available for flights from AER to SVO (i.e. from Adler/Sochi to Sheremetevo/Moscow)

In [6]:
%%sql
SELECT DISTINCT fare_conditions
FROM ticket_flights
WHERE flight_id IN (SELECT flight_id FROM flights
                    WHERE departure_airport = 'AER' AND arrival_airport = 'SVO')

 * postgresql://reader:***@10.129.0.25/demo
3 rows affected.

[('Business',), ('Comfort',), ('Economy',)]

### Q2: A list of aircraft models which fly to the Yakutsk AND Abakan cities

In [7]:
%%sql
SELECT DISTINCT a.model
FROM aircrafts a
WHERE a.aircraft_code IN (SELECT f.aircraft_code
                          FROM flights f 
                          WHERE f.arrival_airport IN ('YKS', 'ABA')
                          GROUP BY f.aircraft_code
                          HAVING COUNT(DISTINCT f.arrival_airport) = 2)

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[('Airbus A319-100',)]

### Q3: A list of aircraft models which fly to the Yakutsk OR Abakan cities

In [8]:
%%sql
SELECT DISTINCT a.model
FROM aircrafts a
WHERE a.aircraft_code IN (SELECT f.aircraft_code
                          FROM flights f
                          WHERE f.arrival_airport IN ('YKS', 'ABA'))

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('Airbus A319-100',),
 ('Boeing 737-300',),
 ('Bombardier CRJ-200',),
 ('Cessna 208 Caravan',),
 ('Sukhoi Superjet-100',)]

### Q4. A list of aircrafts which DONâ€™T fly to Yakutsk city

In [9]:
%%sql
SELECT DISTINCT a.model, a.aircraft_code
FROM aircrafts a
WHERE a.aircraft_code NOT IN (SELECT aircraft_code    
                              FROM flights    
                              WHERE arrival_airport = 'YKS'
)

 * postgresql://reader:***@10.129.0.25/demo
6 rows affected.

[('Airbus A320-200', '320'),
 ('Airbus A321-200', '321'),
 ('Boeing 737-300', '733'),
 ('Boeing 767-300', '763'),
 ('Boeing 777-300', '773'),
 ('Cessna 208 Caravan', 'CN1')]

### Q5. Find out airport codes related to Mrs. 'ELLA DMITRIEVA'  - from where and to where she flew.

In [10]:
%%sql
SELECT DISTINCT fl.departure_airport, fl.arrival_airport
FROM flights fl
WHERE fl.flight_id IN (SELECT tf.flight_id
                       FROM ticket_flights tf
                       WHERE tf.ticket_no IN (
                           SELECT ticket_no
                           FROM tickets
                           WHERE passenger_name = 'ELLA DMITRIEVA'
    )
)

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('DME', 'HMA'),
 ('DME', 'UUS'),
 ('HMA', 'DME'),
 ('MQF', 'SVX'),
 ('SVO', 'SVX'),
 ('SVX', 'MQF'),
 ('SVX', 'SVO')]

## Conclusion
During this homework I started to prefer IPython with magic commnds more because it is more convenient for extracting separate lines. I also think it was quite simple, so huge shoutout to this task, as it didn't make me want to reevaluate my life choices